examples/gateFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (  0   0 -0.5)    // 0
    (5.0   0 -0.5)    // 1
    (5.0 4.0 -0.5)    // 2
    (  0 4.0 -0.5)    // 3
    
    (  0   0  0.5)    // 4.0
    (5.0   0  0.5)    // 5
    (5.0 4.0  0.5)    // 6
    (  0 4.0  0.5)    // 7
);

blocks
(
    // hex (点序列) (网格数量: x y z) 渐变比例
    hex (0 1 2 3 4 5 6 7) (100 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
    
);

mergePatchPairs
(
);

// ************************************************************************* //